Linear-Equations/notes.org
#+title: Linear Equations
#+HTML_MATHJAX: align: left indent: 2em
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../myStyle.css" />
#+HTML_HEAD: <script src="example-line.js"></script>
#+HTML_HEAD: <script src="../Elm-LA/example-plane.js"></script>
#+OPTIONS: html-style:nil H:2 toc:1 num:nil tasks:nil
#+HTML_LINK_HOME: ../toc.html
We begin by looking at systems of linear equations.  This will form
the basis of what we will consider in the first part of the course.
* Keywords
+ [[solution set][Solution set]]
+ [[consistent][Consistency]]
* Basics
Linear algebra is, at its core, the study of /linear equations/.

#+begin_quote
*Definition.* A *linear equation* in the variables $x_1, x_2, \dots,
x_n$ is an equation that can expressed in the form

\[
a_1 x_1 + a_2 x_2 + \dots + a_n x_n = b
\]

where $a_1, a_2, \dots, a_n$ and $b$ are real numbers.[fn::It's also
possible to consider the case in which these are complex numbers, but
we will only consider real numbers in this course.]
#+end_quote

The numbers $a_1, \dots, a_n$ in the definition above are called
*coefficients*.  Variables are also sometimes called *unknowns*.

#+begin_quote
*Example.* The equation

\[
  1.2x + \sqrt{3}y + 10z = \pi
\]

is a linear equation[fn::When it comes to unknowns in algebraic
equations, it doesn't matter what symbols we use. Sometimes we'll use
$x$, $y$ and $z$, other times we'll use $x_1$, $x_2$, and $x_3$.  It
will always be clear from context which symbols are variables.]
whereas

\[
xy + 3z = 0
\]

is not.  Also keep in mind that

\[
3(x - 4) = z
\]

is a linear equation because it can be expressed as

\[
3x + (-1)z = 12
\]
#+end_quote

In your first course on algebra, you should have been introduced to a
simple kind of linear equation: lines in the plane.  You likely first
learned the /slope-intercept form/ of a line

\[
y = mx + b
\]

where $m$ and $b$ are real numbers.  You then also likely learned the
/general form/

\[
ax + by = c
\]

where $a$, $b$, and $c$ are real numbers and $x$ and $y$ are
variables.

*An equation for a line in the plane is the same as a linear equation
in two variables.*

#+begin_quote
*Example.* The equation $2x + 3y = -6$ is the general form
of the line

\[
  y = \left(-\frac{2}{3}\right)x - 2
\]

in slope-intercept form.
#+end_quote

A linear equation in $n$ variables defines a set of points in
$\mathbb R^n$.  We write a point in $\mathbb R^n$ as we would write a
tuple in Python, e.g., $(3.3, 12.03, \sqrt{3}, 4)$ is a point in
$\mathbb R^4$.  In set notation, a linear equation

\[
a_1x_1 + \dots + a_n x_n = b
\]

defines the set of points

\[
\{ (c_1, \dots, c_n) : a_1 c_1 + \dots + a_n c_n = b \}
\]

which is a subset of $\mathbb R^n$.  This notation expresses the basic
fact that linear equation defines the set of points that satisfy it.

If we plot the entire set of points defined by a linear equation in two
variables, we get a line in the plane.

#+begin_quote
*Example.* This is the graph of the line $y =
\left(-\frac{2}{3}\right)x - 2$.  The line is made up of all points
$(a, b)$ such that $2a + 3b = -6$, e.g., the points $(-9, 4)$, $(6,
-6)$, and $(12, -10)$.
#+begin_export html
  <div id="testing"></div>
  <script>
  var app = Elm.ExampleLine.init({
    node: document.getElementById('testing')
    });
  </script>
#+end_export
#+end_quote

If we plot the set of points defined  by a linear equation in /three/
variables, we get a plane in $\mathbb R^3$.  We can imagine this is an
infinite sheet of paper floating in space.

#+begin_quote
*Example.* This is the graph of the plane defined by the equation $x +
y + z = 1$.  The plane includes, for example, the points $(4, 3,
-6)$, $(-3, -5, 9)$, and $(-8, 8, 1)$.
#+begin_export html
  <div id="example-plane"></div>
  <script>
  var app = Elm.ExamplePlane.init({
    node: document.getElementById('example-plane')
    });
  </script>
#+end_export
#+end_quote

We call the set of points described by a linear equation in more than
three variables a *hyperplane*.  We can't visualize hyperplanes, but
we can often take advantage of our intuitions about planes in $\mathbb
R^3$.[fn::For example (and this will be more clear as we get further
into the material) just like a plane in $\mathbb R^3$ separates
$\mathbb R^3$ into two disjoint regions, a plane in $\mathbb R^{1934}$
also separates $\mathbb R^{1934}$ into two disjoint regions.]

As helpful as our geometric intuitions may be, linear equations are
perhaps more useful when we think about them algebraically.  They
naturally describe relations that come up in tons of application
domains.

#+begin_quote
*Example.* Suppose you have $5$ dollars and you're at a candy store
which sells candies by the pound.  You're interested in buying the
following four candies in unknown amounts.

| swedish fish              | $10.50/lb |
| chocolate covered peanuts | $7.25/lb |
| peach rings               | $14.65/lb |
| gummy bears               | $6.00/lb  |

If you want to spend all $5$ dollars, then the amounts of each candy
you can buy are related by the following linear equation in the
variables $s$, $c$, $p$, and $g$.

\[
10.50s + 7.25c + 14.65p + 6g = 5
\]
#+end_quote

I will leave it to you to map this example onto a more "useful"
domain.

#+begin_quote
*Exercise.* Find two distinct points in the point-set define by the
equation in the candy store example.  What do these two points
represent intuitively?
#+end_quote

