Linear-Equations/notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-19 Fri 13:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linear Equations</title>
<meta name="author" content="Nathan  Mull" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../myStyle.css" />

</head>
<body>
<div id="org-div-home-and-up">⟨ <a href="../toc.html">back</a> ⟩</div><div id="content" class="content">
<h1 class="title">Linear Equations</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org133154a">Keywords</a></li>
<li><a href="#org6af77cd">Basics</a></li>
<li><a href="#orgd7427fa">Systems of Linear Equations</a></li>
<li><a href="#org901650f">Solving Linear Systems</a></li>
<li><a href="#orgc63fea7">Matrices and Row Operations</a></li>
<li><a href="#orga54696b">SymPy and Row Operations</a></li>
</ul>
</div>
</div>
<p>
We begin by looking at systems of linear equations.  This will form
the basis of what we will consider in the first part of the course.
</p>
<div id="outline-container-org133154a" class="outline-2">
<h2 id="org133154a">Keywords</h2>
<div class="outline-text-2" id="text-org133154a">
<ul class="org-ul">
<li><a href="#orgb0b6506">Solution set</a></li>
<li><a href="#orgf52b3dd">Consistency</a></li>
</ul>
</div>
</div>
<div id="outline-container-org6af77cd" class="outline-2">
<h2 id="org6af77cd">Basics</h2>
<div class="outline-text-2" id="text-org6af77cd">
<p>
Linear algebra is, at its core, the study of <i>linear equations</i>.
</p>

<blockquote>
<p>
<b>Definition.</b> A <b>linear equation</b> in the variables \(x_1, x_2, \dots,
x_n\) is an equation that can expressed in the form
</p>

<p>
\[
a_1 x_1 + a_2 x_2 + \dots + a_n x_n = b
\]
</p>

<p>
where \(a_1, a_2, \dots, a_n\) and \(b\) are real numbers.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>
</blockquote>

<p>
The numbers \(a_1, \dots, a_n\) in the definition above are called
<b>coefficients</b>.  Variables are also sometimes called <b>unknowns</b>.
</p>

<blockquote>
<p>
<b>Example.</b> The equation
</p>

<p>
\[
  1.2x + \sqrt{3}y + 10z = \pi
\]
</p>

<p>
is a linear equation<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>
whereas
</p>

<p>
\[
xy + 3z = 0
\]
</p>

<p>
is not.  Also keep in mind that
</p>

<p>
\[
3(x - 4) = z
\]
</p>

<p>
is a linear equation because it can be expressed as
</p>

<p>
\[
3x + (-1)z = 12
\]
</p>
</blockquote>

<p>
In your first course on algebra, you should have been introduced to a
simple kind of linear equation: lines in the plane.  You likely first
learned the <i>slope-intercept form</i> of a line
</p>

<p>
\[
y = mx + b
\]
</p>

<p>
where \(m\) and \(b\) are real numbers.  You then also likely learned the
<i>general form</i>
</p>

<p>
\[
ax + by = c
\]
</p>

<p>
where \(a\), \(b\), and \(c\) are real numbers and \(x\) and \(y\) are
variables.
</p>

<p>
<b>An equation for a line in the plane is the same as a linear equation
in two variables.</b>
</p>

<blockquote>
<p>
<b>Example.</b> The equation \(2x + 3y = -6\) is the general form
of the line
</p>

<p>
\[
  y = \left(-\frac{2}{3}\right)x - 2
\]
</p>

<p>
in slope-intercept form.
</p>
</blockquote>

<p>
A linear equation in \(n\) variables defines a set of points in
\(\mathbb R^n\).  We write a point in \(\mathbb R^n\) as we would write a
tuple in Python, e.g., \((3.3, 12.03, \sqrt{3}, 4)\) is a point in
\(\mathbb R^4\).  In set notation, a linear equation
</p>

<p>
\[
a_1x_1 + \dots + a_n x_n = b
\]
</p>

<p>
defines the set of points
</p>

<p>
\[
\{ (c_1, \dots, c_n) : a_1 c_1 + \dots + a_n c_n = b \}
\]
</p>

<p>
which is a subset of \(\mathbb R^n\).  This notation expresses the basic
fact that linear equation defines the set of points that satisfy it.
</p>

<p>
If we plot the entire set of points defined by a linear equation in two
variables, we get a line in the plane.
</p>

<blockquote>
<p>
<b>Example.</b> This is the graph of the line \(y =
\left(-\frac{2}{3}\right)x - 2\).  The line is made up of all points
\((a, b)\) such that \(2a + 3b = -6\), e.g., the points \((-9, 4)\), \((6,
-6)\), and \((12, -10)\).
</p>
<div id="testing"></div>
<script>
var app = Elm.ExampleLine.init({
  node: document.getElementById('testing')
  });
</script>
</blockquote>

<p>
If we plot the set of points defined  by a linear equation in <i>three</i>
variables, we get a plane in \(\mathbb R^3\).  We can imagine this is an
infinite sheet of paper floating in space.
</p>

<blockquote>
<p>
<b>Example.</b> This is the graph of the plane defined by the equation \(x +
y + z = 1\).  The plane includes, for example, the points \((4, 3,
-6)\), \((-3, -5, 9)\), and \((-8, 8, 1)\).
</p>
<div id="example-plane"></div>
<script>
var app = Elm.ExamplePlane.init({
  node: document.getElementById('example-plane')
  });
</script>
</blockquote>

<p>
We call the set of points described by a linear equation in more than
three variables a <b>hyperplane</b>.  We can't visualize hyperplanes, but
we can often take advantage of our intuitions about planes in \(\mathbb
R^3\).<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>
</p>

<p>
As helpful as our geometric intuitions may be, linear equations are
perhaps more useful when we think about them algebraically.  They
naturally describe relations that come up in tons of application
domains.
</p>

<blockquote>
<p>
<b>Example.</b> Suppose you have \(5\) dollars and you're at a candy store
which sells candies by the pound.  You're interested in buying the
following four candies in unknown amounts.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">swedish fish</td>
<td class="org-left">$10.50/lb</td>
</tr>

<tr>
<td class="org-left">chocolate covered peanuts</td>
<td class="org-left">$7.25/lb</td>
</tr>

<tr>
<td class="org-left">peach rings</td>
<td class="org-left">$14.65/lb</td>
</tr>

<tr>
<td class="org-left">gummy bears</td>
<td class="org-left">$6.00/lb</td>
</tr>
</tbody>
</table>

<p>
If you want to spend all \(5\) dollars, then the amounts of each candy
you can buy are related by the following linear equation in the
variables \(s\), \(c\), \(p\), and \(g\).
</p>

<p>
\[
10.50s + 7.25c + 14.65p + 6g = 5
\]
</p>
</blockquote>

<p>
I will leave it to you to map this example onto a more "useful"
domain.
</p>

<blockquote>
<p>
<b>Exercise.</b> Find two distinct points in the point-set define by the
equation in the candy store example.  What do these two points
represent intuitively?
</p>
</blockquote>
</div>
</div>
