Linear-Equations/notes.org
* Systems of Linear Equations
The situation is made more interesting by considering multiple linear
equations /simultaneously/.

#+begin_quote
*Definition.* A *system of linear equations (linear system)* in the
 variables $x_1, \dots, x_n$ is a collection of linear equations in
 the same variables.
#+end_quote

When we consider a system of linear equations, we are usually
interested in the points which the sets defined by /every/ equation in
the system.

#+begin_quote
*Definition.* A *solution* to a system of linear equations in $n$
 variables is a point in $\mathbb R^n$ which satisfies /every/
 equation in the system.
#+end_quote

#+begin_quote
*Example.* The point $(4, -2, 0)$ is a solution to the system

\begin{align*}
2x + 3y + 2z &= 2 \\
x + y + z &= 2 \\
x + 3y + 2z &= -2
\end{align*}

because if we set $x = 4$ and $y = -2$ and $z = 0$ in each equation,
every equation is satisfied:

\begin{align*}
2(4) + 3(-2) + 2(0) = 8 + (-6) &= 2 \\
4 + (-2) + 0 &= 2 \\
4 + 3(-2) + 2(0) = 4 + (-6) &= -2
\end{align*}
#+end_quote

We call the set of all solutions to a linear system its *solution set*
<<solution set>> (naturally).  Geometrically, the solution set of a
linear system corresponds to the /intersection/ of the point-sets that
each linear equation defines.  So the problem of solving a system of
linear equations is analogous to the 2-dimensional line-intersection
problem.

#+begin_quote
*Example* TODO PICTURE (two lines intersecting at a point, two planes
 intersecting at a line).
#+end_quote

#+begin_quote
*Exercise.* Verify that $(7, 1, 1)$ is a point is the solution set of
\begin{align*}
x + 2y &= 9 \\
3y + z &= 4 \\
-x + z &= -6
\end{align*}
#+end_quote

Our primary question moving forward will be: *what does the solution
set of a given linear system look like?* It turns out there are only
three options.

#+begin_quote
*Theorem.* A system of linear equations either has zero, one, or
 infinitely many solutions.
#+end_quote

As we progress, we will be able to exactly describe the "shape" of a
solution set, but for now we will be interested in two questions.

+ /(Existence)/ Does the system have a solution?
+ /(Uniqueness)/ If it does have a solution, is it the /only/
  solution?

And, as is characteristic in linear algebra, we will introduce a fair
amount of terminology for saying the same things in different ways
(for better or for worse).

#+begin_quote
*Terminology.* A system of linear equations is called *consistent*
 <<consistent>> if it has a solution. Otherwise it is called
 *inconsistent*.
#+end_quote

#+begin_quote
*Exercise.* /(Challenge)/ Suppose that $(c_1, \dots, c_n)$ and $(d_1,
\dots d_n)$ are distinct solutions to a given linear system.  Show
that

\[
\left(
\frac{c_1 + d_1}{2},
\dots,
\frac{c_n + d_n}{2}
\right)
\]

is also a solution.
#+end_quote

* Solving Linear Systems

Solving a system of linear equations means finding a solution[fn::As
we will see, it can also mean describing the set of all possible
solutions.] or showing that no such solution exists.

As a warm-up, let's first consider a system of linear equations in two
variables.

Since linear equations in two variables define lines in
the plane, and solutions represent /intersections/, finding a solution
to this system means determining the point of intersection two lines
in the plane.

It's likely we were taught to solve the line-intersection problem using
the *substitution method*:
+ solve for $x$ in terms of $y$ in first equation
+ substitute $x$ in the second equation
+ solve for $y$
+ substitute $y$ in the first equation
+ solve for $x$

#+begin_quote
*Example.* Consider the following system of linear equations

\begin{align*}
-x -2y &= 1 \\
x + y &= 2
\end{align*}

Solving for $x$ in the first equation gives us

\[
x = -2y - 1
\]

Substituting the right-hand side for $x$ in the second equation gives
us

\[
(-2y - 1) + y = 2
\]

Solving for $y$ in this new equation gives us $y = -3$, and
substituting this for $y$ in first equation gives us

\[
-x - 2(-3) = 1
\]

Solving for $x$ finally gives us $x = 5$, so $(5, -3)$ is a solution.
#+end_quote

#+begin_quote
*Exercise.* Find a solution to the system

\begin{align*}
-x + y &= 2 \\
-3x + 2y &= 2
\end{align*}

using the substitution method.
#+end_quote

The substitution method work perfectly well, but it doesn't scale well if we
want to solve systems with more variables.

The method (which we hopefully were also taught) that will be useful
for this is the *elimination method*:
+ eliminate the appearance of $x$ in the second equation by adding to
  the second equation a multiple of the first (this solves for $y$)
+ substitute the value for $y$ into the first equation (this solves
  for $x$)

#+begin_quote
*Example.* Consider again the system

\begin{align*}
-x -2y &= 1 \\
x + y &= 2
\end{align*}

we can eliminate the appearance of $x$ in the second equation by
adding the first equation to the second equation:

\begin{align*}
-x - 2y &= 1 \\
x + y &= 2 &+ \\
\hline
- y &= 3
\end{align*}
So $y = 3$ and we can substitute this value for $y$ into the first equation:
\[
-x -2(-3) = 1
\]
So $x = 5$ and $(5, 3)$ is a solution.
#+end_quote

#+begin_quote
*Exercise.* Find a solution to the system

\begin{align*}
-x + y &= 2 \\
-3x + 2y &= 2
\end{align*}

using the elimination method.
#+end_quote

The elimination method is the basis of /Gaussian elimination/, our
next topic.  In its simplest form, the elimination method has two
phases: *forward elimination* and *back substitution*.  Rather than
dwelling on how this works in general (we will get to that), here is
an outline for using the elimination method for a linear system in
three variables:

+ /(Forward elimination)/
  + eliminate $x$ from all but the first equation
  + eliminate $y$ from all but the first and second equation
  + solve for the value of $z$ in the third equation
+ /(Back substitution)/
  + substitute the value of $z$ into the first and second equation
  + solve for $y$ in the second equation
  + substitute the value of $y$ into the first equation
  + solve for $x$ in the first equation.

#+begin_quote
*Example.* Suppose we're interested in ... (chemistry example)
#+end_quote

Hopefully this is enough to get you thinking about how to apply this
in the case of four variables.

