Linear-Equations/notes.html

<div id="outline-container-orgd7427fa" class="outline-2">
<h2 id="orgd7427fa">Systems of Linear Equations</h2>
<div class="outline-text-2" id="text-orgd7427fa">
<p>
The situation is made more interesting by considering multiple linear
equations <i>simultaneously</i>.
</p>

<blockquote>
<p>
<b>Definition.</b> A <b>system of linear equations (linear system)</b> in the
 variables \(x_1, \dots, x_n\) is a collection of linear equations in
 the same variables.
</p>
</blockquote>

<p>
When we consider a system of linear equations, we are usually
interested in the points which the sets defined by <i>every</i> equation in
the system.
</p>

<blockquote>
<p>
<b>Definition.</b> A <b>solution</b> to a system of linear equations in \(n\)
 variables is a point in \(\mathbb R^n\) which satisfies <i>every</i>
 equation in the system.
</p>
</blockquote>

<blockquote>
<p>
<b>Example.</b> The point \((4, -2, 0)\) is a solution to the system
</p>

\begin{align*}
2x + 3y + 2z &= 2 \\
x + y + z &= 2 \\
x + 3y + 2z &= -2
\end{align*}

<p>
because if we set \(x = 4\) and \(y = -2\) and \(z = 0\) in each equation,
every equation is satisfied:
</p>

\begin{align*}
2(4) + 3(-2) + 2(0) = 8 + (-6) &= 2 \\
4 + (-2) + 0 &= 2 \\
4 + 3(-2) + 2(0) = 4 + (-6) &= -2
\end{align*}
</blockquote>

<p>
We call the set of all solutions to a linear system its <b>solution set</b>
<a id="orgb0b6506"></a> (naturally).  Geometrically, the solution set of a
linear system corresponds to the <i>intersection</i> of the point-sets that
each linear equation defines.  So the problem of solving a system of
linear equations is analogous to the 2-dimensional line-intersection
problem.
</p>

<blockquote>
<p>
<b>Example</b> TODO PICTURE (two lines intersecting at a point, two planes
 intersecting at a line).
</p>
</blockquote>

<blockquote>
<p>
<b>Exercise.</b> Verify that \((7, 1, 1)\) is a point is the solution set of
</p>
\begin{align*}
x + 2y &= 9 \\
3y + z &= 4 \\
-x + z &= -6
\end{align*}
</blockquote>

<p>
Our primary question moving forward will be: <b>what does the solution
set of a given linear system look like?</b> It turns out there are only
three options.
</p>

<blockquote>
<p>
<b>Theorem.</b> A system of linear equations either has zero, one, or
 infinitely many solutions.
</p>
</blockquote>

<p>
As we progress, we will be able to exactly describe the "shape" of a
solution set, but for now we will be interested in two questions.
</p>

<ul class="org-ul">
<li><i>(Existence)</i> Does the system have a solution?</li>
<li><i>(Uniqueness)</i> If it does have a solution, is it the <i>only</i>
solution?</li>
</ul>

<p>
And, as is characteristic in linear algebra, we will introduce a fair
amount of terminology for saying the same things in different ways
(for better or for worse).
</p>

<blockquote>
<p>
<b>Terminology.</b> A system of linear equations is called <b>consistent</b>
 <a id="orgf52b3dd"></a> if it has a solution. Otherwise it is called
 <b>inconsistent</b>.
</p>
</blockquote>

<blockquote>
<p>
<b>Exercise.</b> <i>(Challenge)</i> Suppose that \((c_1, \dots, c_n)\) and \((d_1,
\dots d_n)\) are distinct solutions to a given linear system.  Show
that
</p>

<p>
\[
\left(
\frac{c_1 + d_1}{2},
\dots,
\frac{c_n + d_n}{2}
\right)
\]
</p>

<p>
is also a solution.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org901650f" class="outline-2">
<h2 id="org901650f">Solving Linear Systems</h2>
<div class="outline-text-2" id="text-org901650f">
<p>
Solving a system of linear equations means finding a solution<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup> or showing that no such solution exists.
</p>

<p>
As a warm-up, let's first consider a system of linear equations in two
variables.
</p>

<p>
Since linear equations in two variables define lines in
the plane, and solutions represent <i>intersections</i>, finding a solution
to this system means determining the point of intersection two lines
in the plane.
</p>

<p>
It's likely we were taught to solve the line-intersection problem using
the <b>substitution method</b>:
</p>
<ul class="org-ul">
<li>solve for \(x\) in terms of \(y\) in first equation</li>
<li>substitute \(x\) in the second equation</li>
<li>solve for \(y\)</li>
<li>substitute \(y\) in the first equation</li>
<li>solve for \(x\)</li>
</ul>

<blockquote>
<p>
<b>Example.</b> Consider the following system of linear equations
</p>

\begin{align*}
-x -2y &= 1 \\
x + y &= 2
\end{align*}

<p>
Solving for \(x\) in the first equation gives us
</p>

<p>
\[
x = -2y - 1
\]
</p>

<p>
Substituting the right-hand side for \(x\) in the second equation gives
us
</p>

<p>
\[
(-2y - 1) + y = 2
\]
</p>

<p>
Solving for \(y\) in this new equation gives us \(y = -3\), and
substituting this for \(y\) in first equation gives us
</p>

<p>
\[
-x - 2(-3) = 1
\]
</p>

<p>
Solving for \(x\) finally gives us \(x = 5\), so \((5, -3)\) is a solution.
</p>
</blockquote>

<blockquote>
<p>
<b>Exercise.</b> Find a solution to the system
</p>

\begin{align*}
-x + y &= 2 \\
-3x + 2y &= 2
\end{align*}

<p>
using the substitution method.
</p>
</blockquote>

<p>
The substitution method work perfectly well, but it doesn't scale well if we
want to solve systems with more variables.
</p>

<p>
The method (which we hopefully were also taught) that will be useful
for this is the <b>elimination method</b>:
</p>
<ul class="org-ul">
<li>eliminate the appearance of \(x\) in the second equation by adding to
the second equation a multiple of the first (this solves for \(y\))</li>
<li>substitute the value for \(y\) into the first equation (this solves
for \(x\))</li>
</ul>

<blockquote>
<p>
<b>Example.</b> Consider again the system
</p>

\begin{align*}
-x -2y &= 1 \\
x + y &= 2
\end{align*}

<p>
we can eliminate the appearance of \(x\) in the second equation by
adding the first equation to the second equation:
</p>

\begin{align*}
-x - 2y &= 1 \\
x + y &= 2 &+ \\
\hline
- y &= 3
\end{align*}
<p>
So \(y = 3\) and we can substitute this value for \(y\) into the first equation:
\[
-x -2(-3) = 1
\]
So \(x = 5\) and \((5, 3)\) is a solution.
</p>
</blockquote>

<blockquote>
<p>
<b>Exercise.</b> Find a solution to the system
</p>

\begin{align*}
-x + y &= 2 \\
-3x + 2y &= 2
\end{align*}

<p>
using the elimination method.
</p>
</blockquote>

<p>
The elimination method is the basis of <i>Gaussian elimination</i>, our
next topic.  In its simplest form, the elimination method has two
phases: <b>forward elimination</b> and <b>back substitution</b>.  Rather than
dwelling on how this works in general (we will get to that), here is
an outline for using the elimination method for a linear system in
three variables:
</p>

<ul class="org-ul">
<li><i>(Forward elimination)</i>
<ul class="org-ul">
<li>eliminate \(x\) from all but the first equation</li>
<li>eliminate \(y\) from all but the first and second equation</li>
<li>solve for the value of \(z\) in the third equation</li>
</ul></li>
<li><i>(Back substitution)</i>
<ul class="org-ul">
<li>substitute the value of \(z\) into the first and second equation</li>
<li>solve for \(y\) in the second equation</li>
<li>substitute the value of \(y\) into the first equation</li>
<li>solve for \(x\) in the first equation.</li>
</ul></li>
</ul>

<blockquote>
<p>
<b>Example.</b> Suppose we're interested in &#x2026; (chemistry example)
</p>
</blockquote>

<p>
Hopefully this is enough to get you thinking about how to apply this
in the case of four variables.
</p>
</div>
</div>
