Linear-Equations/notes.org
* Matrices and Row Operations

Matrices are very simple mathematical objects: A matrix is just a grid
of things.  It doesn't matter terribly what those things are, but in
this course we will be exclusively interested in the case that those
things are real numbers.

A matrix is like a list of lists in Python (and we will, in essence,
represent them that way) with the restriction that
+ every element is the same kind of thing
+ the list is non-empty (there is at least one row)
+ every list in the list is the same length (each row has the same
  length)

Thus, a matrix is characterized by what sort of things it contains,
how many *rows* it has, and how many *columns* it has.  We will use
the notation $\mathbb R^{m \times n}$ to refer to the collection of
all possible matrices with real numbers, $m$ rows and $n$ columns.

#+begin_quote
*Example.*

$\begin{bmatrix}
3 & -2 & \pi \\
0.1 & 4 & 1000
\end{bmatrix}$

is a $2 \times 3$ matrix, i.e., it is a matrix in $\mathbb R^{2 \times
3}$.
#+end_quote

I want to emphasize that *a matrix has no inherent meaning*.  They are
just a convenient way to store data.  The "meaning" of a matrix comes
from how we work with it, how we interpret it.

#+begin_quote
*Example.* We can think of a piece of 2-bit pixel art as a matrix
containing values between 0 and 3.

#+end_quote

#+begin_quote
*Definition.* The *augmented matrix* of a linear system

\begin{align*}
a_{11}x_1 + \dots + a_{1n} x_n &= b_1 \\
a_{21}x_1 + \dots + a_{2n} x_n &= b_2 \\
&\vdots \\
a_{m1}x_1 + \dots + a_{mn} x_n &= b_m
\end{align*}

with $m$ equations and $n$ unknowns is the $m \times (n + 1)$ matrix

\begin{bmatrix}
a_{11} & \dots & a_{1n} & b_1 \\
a_{21} & \dots & a_{2n} & b_2 \\
\vdots & \ddots & \vdots & \vdots \\
a_{m1} & \dots & a_{mn} & b_m
\end{bmatrix}

the *coefficient matrix* of the same system is the $m \times n$ matrix

\begin{bmatrix}
a_{11} & \dots & a_{1n}\\
a_{21} & \dots & a_{2n} \\
\vdots & \ddots & \vdots \\
a_{m1} & \dots & a_{mn}
\end{bmatrix}
#+end_quote

#+begin_quote
*Example.* (TAKE FROM THE CHEMISTRY EXAMPLE)
#+end_quote

#+begin_quote
*Definition.* Two systems of linear equations are *equivalent* if they
 have the same solution set.
#+end_quote

#+begin_quote
*Definition.* The *elementary row operations* are
| replace(A, i, c, j) | add row j scaled by c to row j      |
| scale(A, c, i)      | multiply every entry in the row i c |
| swap(A, i, j)       | swap row i and row j                |
Two matrices $A$ and $B$ are *row equivalent* (written $A \sim B$) if
there is a sequence of row operations which transforms $A$ to $B$.
#+end_quote

#+begin_quote
*Example.* (TRANFORMATION)

#+end_quote

#+begin_quote
*Theorem.* Two linear systems are equivalent if and only if their augmented matrices are row equivalent.
#+end_quote

