Linear-Equations/notes.html

<div id="outline-container-orgc63fea7" class="outline-2">
<h2 id="orgc63fea7">Matrices and Row Operations</h2>
<div class="outline-text-2" id="text-orgc63fea7">
<p>
Matrices are very simple mathematical objects: A matrix is just a grid
of things.  It doesn't matter terribly what those things are, but in
this course we will be exclusively interested in the case that those
things are real numbers.
</p>

<p>
A matrix is like a list of lists in Python (and we will, in essence,
represent them that way) with the restriction that
</p>
<ul class="org-ul">
<li>every element is the same kind of thing</li>
<li>the list is non-empty (there is at least one row)</li>
<li>every list in the list is the same length (each row has the same
length)</li>
</ul>

<p>
Thus, a matrix is characterized by what sort of things it contains,
how many <b>rows</b> it has, and how many <b>columns</b> it has.  We will use
the notation \(\mathbb R^{m \times n}\) to refer to the collection of
all possible matrices with real numbers, \(m\) rows and \(n\) columns.
</p>

<blockquote>
<p>
<b>Example.</b>
</p>

<p>
\(\begin{bmatrix}
3 & -2 & \pi \\
0.1 & 4 & 1000
\end{bmatrix}\)
</p>

<p>
is a \(2 \times 3\) matrix, i.e., it is a matrix in \(\mathbb R^{2 \times
3}\).
</p>
</blockquote>

<p>
I want to emphasize that <b>a matrix has no inherent meaning</b>.  They are
just a convenient way to store data.  The "meaning" of a matrix comes
from how we work with it, how we interpret it.
</p>

<blockquote>
<p>
<b>Example.</b> We can think of a piece of 2-bit pixel art as a matrix
containing values between 0 and 3.
</p>
</blockquote>

<blockquote>
<p>
<b>Definition.</b> The <b>augmented matrix</b> of a linear system
</p>

\begin{align*}
a_{11}x_1 + \dots + a_{1n} x_n &= b_1 \\
a_{21}x_1 + \dots + a_{2n} x_n &= b_2 \\
&\vdots \\
a_{m1}x_1 + \dots + a_{mn} x_n &= b_m
\end{align*}

<p>
with \(m\) equations and \(n\) unknowns is the \(m \times (n + 1)\) matrix
</p>

\begin{bmatrix}
a_{11} & \dots & a_{1n} & b_1 \\
a_{21} & \dots & a_{2n} & b_2 \\
\vdots & \ddots & \vdots & \vdots \\
a_{m1} & \dots & a_{mn} & b_m
\end{bmatrix}

<p>
the <b>coefficient matrix</b> of the same system is the \(m \times n\) matrix
</p>

\begin{bmatrix}
a_{11} & \dots & a_{1n}\\
a_{21} & \dots & a_{2n} \\
\vdots & \ddots & \vdots \\
a_{m1} & \dots & a_{mn}
\end{bmatrix}
</blockquote>

<blockquote>
<p>
<b>Example.</b> (TAKE FROM THE CHEMISTRY EXAMPLE)
</p>
</blockquote>

<blockquote>
<p>
<b>Definition.</b> Two systems of linear equations are <b>equivalent</b> if they
 have the same solution set.
</p>
</blockquote>

<blockquote>
<p>
<b>Definition.</b> The <b>elementary row operations</b> are
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">replace(A, i, c, j)</td>
<td class="org-left">add row j scaled by c to row j</td>
</tr>

<tr>
<td class="org-left">scale(A, c, i)</td>
<td class="org-left">multiply every entry in the row i c</td>
</tr>

<tr>
<td class="org-left">swap(A, i, j)</td>
<td class="org-left">swap row i and row j</td>
</tr>
</tbody>
</table>
<p>
Two matrices \(A\) and \(B\) are <b>row equivalent</b> (written \(A \sim B\)) if
there is a sequence of row operations which transforms \(A\) to \(B\).
</p>
</blockquote>

<blockquote>
<p>
<b>Example.</b> (TRANFORMATION)
</p>
</blockquote>

<blockquote>
<p>
<b>Theorem.</b> Two linear systems are equivalent if and only if their augmented matrices are row equivalent.
</p>
</blockquote>
</div>
</div>
