Linear-Equations/notes.org
* SymPy and Row Operations

It will be useful (particularly for exams) to practice performing row
operations by hand.  From the CS perspective, we want a better way to
do it.

In the following chapter we will look at /Gaussian elimination/ and
algorithm for performing the "right" row operations to solve a given
linear system (expressed as an augmented matrix).  For now, it would
be nice if we could use a computer to do some tedious calculations for
us.

For the first part of this course, we will be using ~sympy~, a Python
library for symbolic computation.  It has module for working with
matrices, which we can use to perform row operations.

We can create a matrix using the ~Matrix~ constructor, which takes a
list of lists of numbers.  It will only construct a matrix object if
this list of lists satisfies the requirement mentioned above.

#+begin_src python :results output :exports both
  from sympy import pprint
  from sympy.matrices import Matrix

  try:
      A = Matrix([
	  [1, 0],
	  [0]
      ])
  except:
      print("rows aren't the same length")

  A = Matrix([
      [1, 0],
      [0, 1 / 4]
  ])

  print()
  print("A:")
  pprint(A)
#+end_src

#+RESULTS:
: rows aren't the same length
:
: A:
: ⎡1   0  ⎤
: ⎢       ⎥
: ⎣0  0.25⎦

We can use array slicing to access and update rows of a given matrix,
which means we can perform elementary row operations as simple
assignments.

#+begin_src python :results output :exports both
  from sympy import pprint
  from sympy.matrices import Matrix

  A = Matrix([
      [-1, -2, 1],
      [1, 1, 2]
  ])

  print("A:")
  pprint(A)

  print()
  print("first row of A:")
  pprint(A[0,:])

  print()
  print("swap first and second row:")
  A[0,:], A[1,:] = A[1,:], A[0,:]
  pprint(A)

  print()
  print("replace first row with 3 times second row:")
  A[0,:] += 3 * A[1,:]
  pprint(A)

  print()
  print("scale second row by 1/5:")
  A[0,:] /= 5
  pprint(A)
#+end_src

#+RESULTS:
#+begin_example
A:
⎡-1  -2  1⎤
⎢         ⎥
⎣1   1   2⎦

first row of A:
[-1  -2  1]

swap first and second row:
⎡1   1   2⎤
⎢         ⎥
⎣-1  -2  1⎦

replace first row with 3 times second row:
⎡-2  -5  5⎤
⎢         ⎥
⎣-1  -2  1⎦

scale second row by 1/5:
⎡-2/5  -1  1⎤
⎢           ⎥
⎣ -1   -2  1⎦
#+end_example

So, for example, we can determine a solution to the systems of
equations from the previous section.

#+begin_src python :results output :exports both
  from sympy import pprint
  from sympy.matrices import Matrix

  A = Matrix([
      [-1, -2, 1],
      [1, 1, 2]
  ])

			# forward elimination:
  A[1,:] += A[0,:]      # add row 0 to row 1
  A[1,:] *= -1          # scale row 1 by -1

			# back substitution:
  A[0,:] += 2 * A[1,:]  # add 2 times row 1 to row 0
  A[0,:] *= -1          # scale row 0 by -1

  pprint(A)
#+end_src

#+RESULTS:
: ⎡1  0  5 ⎤
: ⎢        ⎥
: ⎣0  1  -3⎦

I need to know how this works before I can work out the details of the
section.

+ Basic outline of LAA
  + linear equations
  + systems of linear equations
  + solutions
  + equivalent systems
  + number of solutions
  + consistency
  + matrices
  + solving systems of linear equations
    + elimination and back substitution
  + elementary row operations
  + existence and uniqueness

+ Basic outline of LAGC
  + Same, ends with more geometric interpretation

I want to include more about using NumPy as a solver.

Questions we can ask about systems of linear equations
+ How many solutions does it have (0, 1, or infinitely many)?
+ Is it consistent?
  + Does it have a solution?
+ Does it have a unique solution?

Exercises
+ Solve this system of linear equations
+ Solve this system of linear equations
+ How many solutions? 0, 1, or infinitely many?
+ Find a value which makes this a consistent system.
+ Write down the shortest sequence of row operations which converts this matrix to this matrix.
+ Thing that doesn't look like system becomes system
+ Write down all the reduced echelon forms of this matrix.
+ Write down the augmented matrix for this system.
+ Word problem.


Programming
+ Write a program that checks if a matrix is in echelon form
  + is a valid matrix
  + also in reduced echelon
